In [12]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.32-cp39-cp39-win_amd64.whl (7.9 MB)
Collecting protobuf<=3.20.3,>=3.11.0
  Downloading protobuf-3.20.3-cp39-cp39-win_amd64.whl (904 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.32 protobuf-3.20.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
#import  libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [3]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MYSQL Database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

#put our mysql terminal password

pw="KS21dec2001!"    #use your own password

#Database name

db="mysql_python"
connection=create_server_connection("localhost","root",pw)

MYSQL Database connection successful

In [7]:
#create mysql_python
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Database create successfully")
    except Error as err:
        print(f"Error:'{err}'")
create_database_query="Create database mysql_python"
create_database(connection,create_database_query)

Database create successfully

In [11]:
#connect to database
def create_db_connection(host_name,user_name,user_password,db_name):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name)
        print("MYSQL Database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [19]:
#execute sql queries
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error:'{err}'")

In [20]:
create_orders_table="""
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""

#connect to the database
connection=create_db_connection("localhost","root",pw,db)
execute_query(connection,create_orders_table)

MYSQL Database connection successful
Query was successful

In [22]:
data_orders="""
insert into orders values
(101,'steve','Laptop','2018-06-12',2,800,'627896543'),
(102,'ste','Books','2019-06-12',2,12,'627896543'),
(103,'san','Laptop','2019-10-02',7,800,'627896543'),
(104,'mandal','Books','2018-07-11',9,400,'627689543'),
(105,'akash','Tshirt','2019-06-17',6,900,'6764396543'),
(106,'dikcha','TV','2018-06-11',2,600,'67896543');
"""

In [23]:
connection=create_db_connection("localhost","root",pw,db)
execute_query(connection,data_orders)

MYSQL Database connection successful
Query was successful

In [24]:
#read query

def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [25]:
#using select statement
q1="""
select * from orders;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

MYSQL Database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '627896543')
(102, 'ste', 'Books', datetime.date(2019, 6, 12), 2, 12.0, '627896543')
(103, 'san', 'Laptop', datetime.date(2019, 10, 2), 7, 800.0, '627896543')
(104, 'mandal', 'Books', datetime.date(2018, 7, 11), 9, 400.0, '627689543')
(105, 'akash', 'Tshirt', datetime.date(2019, 6, 17), 6, 900.0, '6764396543')
(106, 'dikcha', 'TV', datetime.date(2018, 6, 11), 2, 600.0, '67896543')

In [27]:
q2="""
select customer_name,phone_number from orders;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q2)
for result in results:
    print(result)

MYSQL Database connection successful
('steve', '627896543')
('ste', '627896543')
('san', '627896543')
('mandal', '627689543')
('akash', '6764396543')
('dikcha', '67896543')

In [28]:
q3="""
select year(date_ordered) from orders;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q3)
for result in results:
    print(result)

MYSQL Database connection successful
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [29]:
q4="""
select distinct year(date_ordered) from orders;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q4)
for result in results:
    print(result)

MYSQL Database connection successful
(2018,)
(2019,)

In [30]:
q5="""
select * from orders where date_ordered < '2018-12-31'
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q5)
for result in results:
    print(result)

MYSQL Database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '627896543')
(104, 'mandal', 'Books', datetime.date(2018, 7, 11), 9, 400.0, '627689543')
(106, 'dikcha', 'TV', datetime.date(2018, 6, 11), 2, 600.0, '67896543')

In [32]:
q6="""
select * from orders where date_ordered > '2018-12-31'
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q6)
for result in results:
    print(result)

MYSQL Database connection successful
(102, 'ste', 'Books', datetime.date(2019, 6, 12), 2, 12.0, '627896543')
(103, 'san', 'Laptop', datetime.date(2019, 10, 2), 7, 800.0, '627896543')
(105, 'akash', 'Tshirt', datetime.date(2019, 6, 17), 6, 900.0, '6764396543')

In [33]:
q7="""
select * from orders order by unit_price;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q7)
for result in results:
    print(result)

MYSQL Database connection successful
(102, 'ste', 'Books', datetime.date(2019, 6, 12), 2, 12.0, '627896543')
(104, 'mandal', 'Books', datetime.date(2018, 7, 11), 9, 400.0, '627689543')
(106, 'dikcha', 'TV', datetime.date(2018, 6, 11), 2, 600.0, '67896543')
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '627896543')
(103, 'san', 'Laptop', datetime.date(2019, 10, 2), 7, 800.0, '627896543')
(105, 'akash', 'Tshirt', datetime.date(2019, 6, 17), 6, 900.0, '6764396543')

In [36]:
from_db=[]
for result in results:
    result=list(result)
    from_db.append(result)
columns=["order_id","customer_name","product_name","date_ordered","quantity","unit_price","phone_number"]
df=pd.DataFrame(from_db,columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,102,ste,Books,2019-06-12,2,12.0,627896543
1,104,mandal,Books,2018-07-11,9,400.0,627689543
2,106,dikcha,TV,2018-06-11,2,600.0,67896543
3,101,steve,Laptop,2018-06-12,2,800.0,627896543
4,103,san,Laptop,2019-10-02,7,800.0,627896543
5,105,akash,Tshirt,2019-06-17,6,900.0,6764396543

In [37]:
#update statement
update="""
update orders
set unit_price=45
where order_id=103
"""
connection=create_db_connection("localhost","root",pw,db)
execute_query(connection,update)

MYSQL Database connection successful
Query was successful

In [39]:
q8="""
select * from orders where order_id=103;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q8)
for result in results:
    print(result)

MYSQL Database connection successful
(103, 'san', 'Laptop', datetime.date(2019, 10, 2), 7, 45.0, '627896543')

In [40]:
#delete statement
delete_order="""
delete from orders
where order_id=105;
"""
connection=create_db_connection("localhost","root",pw,db)
execute_query(connection,delete_order)

MYSQL Database connection successful
Query was successful

In [41]:
q9="""
select * from orders ;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q9)
for result in results:
    print(result)

MYSQL Database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '627896543')
(102, 'ste', 'Books', datetime.date(2019, 6, 12), 2, 12.0, '627896543')
(103, 'san', 'Laptop', datetime.date(2019, 10, 2), 7, 45.0, '627896543')
(104, 'mandal', 'Books', datetime.date(2018, 7, 11), 9, 400.0, '627689543')
(106, 'dikcha', 'TV', datetime.date(2018, 6, 11), 2, 600.0, '67896543')